dfe-stubs/src/main/resources/wsdl/nfe/ms/prod/return_authorization.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.4.3.payara-p3 (2.4.3.payara-maintenance-a5c1c68; 2019-06-17T14:04:38+0200) JAXWS-RI/2.3.2.payara-p2 JAXWS-API/2.3.2 JAXB-RI/2.3.2 JAXB-API/2.3.2 git-revision#unknown. --><!-- Generated by JAX-WS RI (https://github.com/eclipse-ee4j/metro-jax-ws). RI's version is Metro/2.4.3.payara-p3 (2.4.3.payara-maintenance-a5c1c68; 2019-06-17T14:04:38+0200) JAXWS-RI/2.3.2.payara-p2 JAXWS-API/2.3.2 JAXB-RI/2.3.2 JAXB-API/2.3.2 git-revision#unknown. -->
<definitions
        xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
        xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/"
        xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRetAutorizacao4"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/"
        targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRetAutorizacao4" name="NFeRetAutorizacao4">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRetAutorizacao4"
                        schemaLocation="https://nfe.sefaz.ms.gov.br:443/ws/NFeRetAutorizacao4?xsd=1"/>
        </xsd:schema>
    </types>
    <message name="nfeRetAutorizacaoLote">
        <part name="nfeDadosMsg" element="tns:nfeDadosMsg"/>
    </message>
    <message name="nfeRetAutorizacaoLoteResponse">
        <part name="nfeRetAutorizacaoLoteResult" element="tns:nfeResultMsg"/>
    </message>
    <portType name="NFeRetAutorizacaoSoap">
        <operation name="nfeRetAutorizacaoLote">
            <input wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRetAutorizacao4/nfeRetAutorizacaoLote"
                   message="tns:nfeRetAutorizacaoLote"/>
            <output wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRetAutorizacao4/NFeRetAutorizacaoSoap/nfeRetAutorizacaoLoteResponse"
                    message="tns:nfeRetAutorizacaoLoteResponse"/>
        </operation>
    </portType>
    <binding name="nfeRetAutorizacaoSoap12Binding" type="tns:NFeRetAutorizacaoSoap">
        <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="nfeRetAutorizacaoLote">
            <soap12:operation
                    soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRetAutorizacao4/nfeRetAutorizacaoLote"/>
            <input>
                <soap12:body use="literal"/>
            </input>
            <output>
                <soap12:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="NFeRetAutorizacao4">
        <port name="nfeRetAutorizacaoSoap12" binding="tns:nfeRetAutorizacaoSoap12Binding">
            <soap12:address location="https://nfe.sefaz.ms.gov.br:443/ws/NFeRetAutorizacao4"/>
        </port>
    </service>
</definitions>