demonstracoes/delphi/Win32/Debug/Templates/vm60/SE/pedido_consultarecibo.soap

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:nfer="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRetAutorizacao4"><soap:Header/><soap:Body><nfer:nfeDadosMsg>%s</nfer:nfeDadosMsg></soap:Body></soap:Envelope>